src/main/resources/data.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <daorudanju xmlns="http://HanThink.com/">
      <dengluming>Admin</dengluming>
      <denglumima>E1CCjc7z+m3nmqvYlGnc+LcM8t4=</denglumima>
      <zhangtaoming>????</zhangtaoming>
      <danjuxml>
      <![CDATA[
				<xsdingdanzhubiao>
					<id>235317474</id>
					<changbian></changbian>
						<kehudanhao>4308042</kehudanhao>
						<riqi>2014-11-04</riqi>
						<daohuoriqi>2014-11-06</daohuoriqi>
					<dizhi></dizhi>
				</xsdingdanzhubiao>
						<xsdingdanzibiao>
						<zhubiaoid>235317474</zhubiaoid>
						<huohao>274468</huohao>
						<tiaoxingma></tiaoxingma>
						<shangpinmiaoshu>????????400g</shangpinmiaoshu>
						<shuliang>20.0</shuliang>
						<huansuanlv1></huansuanlv1>
						<xiangshu></xiangshu>
						<hanshuidanjia></hanshuidanjia>
						<hanshuijine></hanshuijine>
						<buhanshuidanjia>22.65</buhanshuidanjia>
						<buhanshuijine>0.0</buhanshuijine>
						<shuilv>17.0</shuilv>
						</xsdingdanzibiao>
						<xsdingdanzibiao>
						<zhubiaoid>235317474</zhubiaoid>
						<huohao>236348</huohao>
						<tiaoxingma></tiaoxingma>
						<shangpinmiaoshu>?????250</shangpinmiaoshu>
						<shuliang>40.0</shuliang>
						<huansuanlv1></huansuanlv1>
						<xiangshu></xiangshu>
						<hanshuidanjia></hanshuidanjia>
						<hanshuijine></hanshuijine>
						<buhanshuidanjia>7.125</buhanshuidanjia>
						<buhanshuijine>0.0</buhanshuijine>
						<shuilv>17.0</shuilv>
						</xsdingdanzibiao>
						<xsdingdanzibiao>
						<zhubiaoid>235317474</zhubiaoid>
						<huohao>236383</huohao>
						<tiaoxingma></tiaoxingma>
						<shangpinmiaoshu>?????250</shangpinmiaoshu>
						<shuliang>20.0</shuliang>
						<huansuanlv1></huansuanlv1>
						<xiangshu></xiangshu>
						<hanshuidanjia></hanshuidanjia>
						<hanshuijine></hanshuijine>
						<buhanshuidanjia>9.4375</buhanshuidanjia>
						<buhanshuijine>0.0</buhanshuijine>
						<shuilv>17.0</shuilv>
						</xsdingdanzibiao>
		]]>
       </danjuxml>
    </daorudanju>
  </soap:Body>
</soap:Envelope>